## Soal 1 (Bobot: 30)

Buatlah sebuah sql query untuk membuat sebuah tabel bernama MENU yang berisi informasi tentang NAMA, JENIS (makanan atau minuman), dan HARGA.

import pymysql<br>

<font color=green>#open database connection</font><br>
db = pymysql.connect("localhost", "testuser", "test123", "TESTDB")<br>

<font color=green>#prepare a cursor object using cursor() method</font><br>
cursor = db.cursor()<br>

<font color=green>#drop table if it already exist using execute() method</font><br>
cursor.execute("DROP TABLE IF EXIST MENU")<br>

<font color=green>#your sql query</font><br>
<font color=red>sql = "....."</font><br>

<font color=green>#execute SQL query using execute() method</font><br>
cursor.execute(sql)<br>

<font color=green>#disconnect from server</font><br>
db.close()<br>

<font color=red>Tulis jawaban anda di bawah!</font>

### 1. Jawab

In [1]:
import pymysql
db=pymysql.connect(host='127.0.0.1',user="root",db='testdb')
cursor=db.cursor()
cursor.execute("drop table if exists menu")
sql="""
create table testdb.menu(
NAMA char(20),
JENIS char(20),
HARGA int)
"""
cursor.execute(sql)
cursor.execute("describe testdb.menu")
cursor.fetchall()

(('NAMA', 'char(20)', 'YES', '', None, ''),
 ('JENIS', 'char(20)', 'YES', '', None, ''),
 ('HARGA', 'int(11)', 'YES', '', None, ''))

## Soal 2 & 3

<img src="menu.png">
<h3><center>Tabel MENU</center></h3>

Buatlah sql query untuk melakukan select data dari tabel MENU yang jenisnya merupakan makanan. (Bobot: 35)

### insert value row pada tabel dulu :

In [2]:
cursor.execute("""
insert into menu(NAMA,JENIS,HARGA)
values('Nasi Goreng','Makanan','14000'),
('Jus Jeruk', 'Minuman','8000'),
('Nasi Liwet','Makanan','14000'),
('Jus Alpukat','Minuman','15000'),
('Fanta','Minuman','7000'),
('Nasi Kebuli','Makanan','20000'),
('Martabak','Makanan','240000')
""")
cursor.execute('select * from menu')
cursor.fetchall()

(('Nasi Goreng', 'Makanan', 14000),
 ('Jus Jeruk', 'Minuman', 8000),
 ('Nasi Liwet', 'Makanan', 14000),
 ('Jus Alpukat', 'Minuman', 15000),
 ('Fanta', 'Minuman', 7000),
 ('Nasi Kebuli', 'Makanan', 20000),
 ('Martabak', 'Makanan', 240000))

In [15]:
cursor.execute('select * from menu')
cursor.description
header = tuple([x[0] for x in cursor.description])
[header]+[cursor.fetchall()]

[('NAMA', 'JENIS', 'HARGA'),
 (('Nasi Goreng', 'Makanan', 14000),
  ('Jus Jeruk', 'Minuman', 8000),
  ('Nasi Liwet', 'Makanan', 14000),
  ('Jus Alpukat', 'Minuman', 15000),
  ('Fanta', 'Minuman', 7000),
  ('Nasi Kebuli', 'Makanan', 20000),
  ('Martabak', 'Makanan', 240000))]

<font color=red>Tulis jawaban anda di bawah!</font>

### 2.Jawab

In [3]:
cursor.execute("select * from testdb.menu where JENIS='Makanan'")
cursor.fetchall()

(('Nasi Goreng', 'Makanan', 14000),
 ('Nasi Liwet', 'Makanan', 14000),
 ('Nasi Kebuli', 'Makanan', 20000),
 ('Martabak', 'Makanan', 240000))

Buatlah sql query untuk melakukan select data dari tabel MENU yang merupakan variasi dari olahan nasi. (Bobot: 35)

<font color=red>Tulis jawaban anda di bawah!</font>

### 3. Jawab

In [4]:
cursor.execute("select * from testdb.menu where nama like 'Nasi%' ")
cursor.fetchall()

(('Nasi Goreng', 'Makanan', 14000),
 ('Nasi Liwet', 'Makanan', 14000),
 ('Nasi Kebuli', 'Makanan', 20000))